export const state = () => ({

  post: {
    name: 'elos-anti-pigmentation',
    mainTitle: 'ELOS борьба с пигментацией',
    shortDescription: 'Избавим вас от пигментов',
    secondTitle: 'ELOS борьба с пигментацией в Бобруйске и Солигорске',
    fullDescription: [{
      id: 1,
      nameDescription: 'О процедуре',
      description: 'Благодаря применению метода ЭЛОС удаление пигментации можно добиться не только полнейшего устранения пигмента или неровного цвета кожи, но и предупредить его дальнейшее возникновение. Процедура практически безболезненна, так как метод имеет специальную дополнительную технологию охлаждения. Проведение процедуры не требует изменения обычного образа жизни. В среднем нужно пройти 4-6 процедур.'
    },
      {
        id: 2,
        nameDescription: 'Показания',
        description: 'Самый эффективный способ забыть о проблеме − это удаление пигментации на лице лазером. Эта услуга является лучшим способом борьбы с веснушками, она не требует хирургического вмешательства, безболезненная и дает отличный результат. Эффективность метода обеспечивается за счет проникновения луча в глубокие слои дермы и разрушения им меланина, при этом другие участки эпидермиса и дермы не повреждаются. После лазерной терапии не остается рубцов и других следов.'
      },
      {
        id: 3,
        nameDescription: 'Противопокозания',
        description: '-наличие свежего загара\n' +
          '-солнечные ожоги\n' +
          '-беременность и период лактации\n' +
          '-острые инфекционные заболевания\n' +
          '-заболевания сахарным диабетом\n' +
          '-онкологические заболевания\n' +
          '-нездоровое состояние сердечно-сосудистой системы\n' +
          '-болезни кожи в обостренных стадиях\n' +
          '-эпилепсия\n' +
          '-склонность к келоидным рубцам\n' +
          '-варикозная болезнь'
      }
    ]
  },
  allPost: [{
    imgLitle: '/img/permanent2_281wh_litle.jpg',
    img: 'img/permanent2_281wh.jpg',
    name: 'elos-epilation',
    mainTitle: 'Лазерная ELOS эпиляция',
    shortDescription: 'Избавим вас от волос',
    secondTitle: 'Лазерная ELOS эпиляция в Бобруйске и Солигорске',
    fullDescription: [{
      id: 1,
      nameDescription: 'О процедуре',
      description: 'ЭЛОС-эпиляция суммирует все преимущества существующих технологий — фотоэпиляции, лазерной эпиляции, электроэпиляции, совмещает электрическую и оптическую энергию. В процессе процедуры волосяной фолликул разрушается под единовременным действием энергии высокочастотного светового импульса и тока. На сегодняшний день эпиляция лазером является самым эффективным и безопасным способом удаления волос на любых участках тела, будь то зоны лица, ног или бикини. А благодаря использованию профессионального оборудования швейцарско-российского концерна, вы получаете наилучший результат для Вас.',
    }, {
      id: 2,
      nameDescription: 'Рекомендации',
      description: 'Эпиляция Elos– это лучший способ избавиться от волос,если: ',
    },
      {
        id: 3,
        nameDescription: 'Противопоказания',
        description: 'Перед записью на сеанс обязательно ознакомьтесь с приведённым списком противопоказаний, при которых эпиляция лазером не рекомендуется или не допускается: - беременность и период лактации - истинный фотодерматит - наличие варикоза(2 + степени), герпеса,псориаза или келоидных рубцов в зоне обработки -волосяные родимые пятна в зоне обработки -множественные родинки на теле -расстройства свертывания(лейкоз) крови -онкологические заболевания -применение гормональных и некоторых обезболивающих препаратов эпилепсия - с нарушение псипосиматической системы -прием препаратов группы тетроциклинов - наличие аллергии на электрический ток -некоторые типы вирусных заболевания - повышенная светочувствительность ',
      },
      {
        id: 4,
        nameDescription: 'Подготовка к процедуре',
        description: 'После процедуры эпиляции лазером для кожи требуется восстановительный период, поэтому, пожалуйста: Воздержитесь от любого пилинга и любых других агрессивных процедур. Не применяйте процедуры эпиляции, связанные с удалением волоса с корнем (воск, пинцет, шугаринг или механический эпилятор). В течение 2-х недель не загорать на солнце или в солярии, использовать SPF-30 и выше',
      },
    ]
  },
    {
      imgLitle: '/img/permanent2_281wh_litle.jpg',
      img: 'img/permanent2_281wh.jpg',
      name: 'elos-rejuvenation',
      mainTitle: 'ELOS омоложение',
      shortDescription: 'Сделаем вашу кожу моложе',
      secondTitle: 'ELOS омоложение в Бобруйске и Солигорске',
      fullDescription: [{
        id: 1,
        nameDescription: 'О процедуре',
        description: 'ELOS-омоложение-это уникальное сочетание двух типов энергий — световой энергии и электрического тока высокой частоты (RF). Только с появлением ELOS-технологии стало возможным оказывать на кожу более глубокое, и в то же время бережное воздействие. В результате стимулируется выработка собственного эластинового комплекса кожи, синтез нового коллагена в её глубинных слоях. Это и есть то самое Элос-омоложение, отзывы о котором сегодня можно услышать повсюду! Статистика улучшений показателей (исследования медицинской школы Корнельского университета США) показывает, что общая удовлетворенность пациентов от результата курса процедур ЭЛОС-омоложения (5 процедур с интервалом в 2 недели) – 92%.-разглаживание морщин-подтягивание кожи (безоперационная подтяжка лица) лифтинг области овала лица и шеи (овал лица подтянуть можно очень быстро)-омоложение кожи лица, груди и рук и даже живота и ягодиц ELOS-омоложение оптимально как для улучшения состояния зрелой кожи у женщин и мужчин, так и для профилактики старения: начните использовать его с 30 лет.'
      }
      ]
    },
    {
      imgLitle: '/img/permanent2_281wh_litle.jpg',
      img: 'img/permanent2_281wh.jpg',
      name: 'elos-anti-pigmentation',
      mainTitle: 'ELOS борьба с пигментацией',
      shortDescription: 'Избавим вас от пигментов',
      secondTitle: 'ELOS борьба с пигментацией в Бобруйске и Солигорске',
      fullDescription: [{
        id: 1,
        nameDescription: 'О процедуре',
        description: 'Благодаря применению метода ЭЛОС удаление пигментации можно добиться не только полнейшего устранения пигмента или неровного цвета кожи, но и предупредить его дальнейшее возникновение. Процедура практически безболезненна, так как метод имеет специальную дополнительную технологию охлаждения. Проведение процедуры не требует изменения обычного образа жизни. В среднем нужно пройти 4-6 процедур.'
      },
        {
          id: 2,
          nameDescription: 'Показания',
          description: 'Самый эффективный способ забыть о проблеме − это удаление пигментации на лице лазером. Эта услуга является лучшим способом борьбы с веснушками, она не требует хирургического вмешательства, безболезненная и дает отличный результат. Эффективность метода обеспечивается за счет проникновения луча в глубокие слои дермы и разрушения им меланина, при этом другие участки эпидермиса и дермы не повреждаются. После лазерной терапии не остается рубцов и других следов.'
        },
        {
          id: 3,
          nameDescription: 'Противопокозания',
          description: '-наличие свежего загара\n' +
            '-солнечные ожоги\n' +
            '-беременность и период лактации\n' +
            '-острые инфекционные заболевания\n' +
            '-заболевания сахарным диабетом\n' +
            '-онкологические заболевания\n' +
            '-нездоровое состояние сердечно-сосудистой системы\n' +
            '-болезни кожи в обостренных стадиях\n' +
            '-эпилепсия\n' +
            '-склонность к келоидным рубцам\n' +
            '-варикозная болезнь'
        }
      ]
    }],
});

export const mutations = {
  setPost(state, data) {
  },

};
export const getters = {
  allCategories: state => state.allCategories,
  getPostByName: state => name => {
    return state.allPost.filter(item => item.name === name.split('/')[1])[0];
  },
  getPosts: state => state.allPost,
};
export const actions = {
  async getCategories({
                        commit
                      }) {
    const resp = await this.$axios.get('http://178.159.242.43:3000/api/categories/').then(resp => {
      commit('setCategories', resp.data);
    });
  },
}
